Layer (type)                 Output Shape              Param #   
=================================================================
in1 (InputLayer)             (None, 2, 16, 16, 16)     0         
_________________________________________________________________
conv1_1 (Conv3D)             (None, 32, 16, 16, 16)    1760      
_________________________________________________________________
bn_1_1 (BatchNormalization)  (None, 32, 16, 16, 16)    128       
_________________________________________________________________
prelu_conv1_1 (PReLU)        (None, 32, 16, 16, 16)    131072    
_________________________________________________________________
conv1_2 (Conv3D)             (None, 32, 16, 16, 16)    27680     
_________________________________________________________________
bn_1_2 (BatchNormalization)  (None, 32, 16, 16, 16)    128       
_________________________________________________________________
prelu_conv1_2 (PReLU)        (None, 32, 16, 16, 16)    131072    
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 32, 8, 8, 8)       0         
_________________________________________________________________
conv2_1 (Conv3D)             (None, 64, 8, 8, 8)       55360     
_________________________________________________________________
bn_2_1 (BatchNormalization)  (None, 64, 8, 8, 8)       256       
_________________________________________________________________
prelu_conv2_1 (PReLU)        (None, 64, 8, 8, 8)       32768     
_________________________________________________________________
conv2_2 (Conv3D)             (None, 64, 8, 8, 8)       110656    
_________________________________________________________________
bn_2_2 (BatchNormalization)  (None, 64, 8, 8, 8)       256       
_________________________________________________________________
prelu_conv2_2 (PReLU)        (None, 64, 8, 8, 8)       32768     
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 64, 4, 4, 4)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dr_d1 (Dropout)              (None, 4096)              0         
_________________________________________________________________
d1 (Dense)                   (None, 256)               1048832   
_________________________________________________________________
prelu_d1 (PReLU)             (None, 256)               256       
_________________________________________________________________
out (Dense)                  (None, 2)                 514       
=================================================================

data
[[[[ 1.6636536  1.4055743  1.1858039 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.7450463  1.5834211  1.3646603 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.6303092  1.4004761  1.2521532 ... -0.7123427 -0.7123427
    -0.7123427]
   ...
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]]

  [[ 1.7247673  1.5435884  1.3061746 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.7554278  1.6774985  1.5116534 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.6756339  1.5043955  1.3740206 ... -0.7123427 -0.7123427
    -0.7123427]
   ...
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]]

  [[ 1.7310178  1.5937165  1.3870585 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.7445016  1.70354    1.6082472 ... -0.7123427 -0.7123427
    -0.7123427]
   [ 1.7265497  1.6223046  1.5173293 ... -0.7123427 -0.7123427
    -0.7123427]
   ...
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]
   [-0.7123427 -0.7123427 -0.7123427 ... -0.7123427 -0.7123427
    -0.7123427]]

truth
[[[0 0 0 ... 0 0 0]
  [0 0 0 ... 0 0 0]
  [0 0 0 ... 0 0 0]




__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 2, 128, 128,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 16, 128, 128, 880         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 128, 128, 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 16, 128, 128, 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 16, 128, 128, 6928        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 128, 128, 64          conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 16, 128, 128, 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
spatial_dropout3d_1 (SpatialDro (None, 16, 128, 128, 0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 16, 128, 128, 6928        spatial_dropout3d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 128, 128, 64          conv3d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 16, 128, 128, 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, 16, 128, 128, 0           leaky_re_lu_1[0][0]              
                                                                 leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 32, 64, 64, 6 13856       add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 64, 64, 6 128         conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 32, 64, 64, 6 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 32, 64, 64, 6 27680       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 64, 64, 6 128         conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 32, 64, 64, 6 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
spatial_dropout3d_2 (SpatialDro (None, 32, 64, 64, 6 0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 32, 64, 64, 6 27680       spatial_dropout3d_2[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 64, 64, 6 128         conv3d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32, 64, 64, 6 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 64, 64, 6 0           leaky_re_lu_4[0][0]              
                                                                 leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 64, 32, 32, 3 55360       add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 32, 32, 3 256         conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 64, 32, 32, 3 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 64, 32, 32, 3 110656      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 32, 32, 3 256         conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 64, 32, 32, 3 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
spatial_dropout3d_3 (SpatialDro (None, 64, 32, 32, 3 0           leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 64, 32, 32, 3 110656      spatial_dropout3d_3[0][0]        
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 32, 32, 3 256         conv3d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 64, 32, 32, 3 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 32, 32, 3 0           leaky_re_lu_7[0][0]              
                                                                 leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 128, 16, 16,  221312      add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128, 16, 16,  512         conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 128, 16, 16,  442496      leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128, 16, 16,  512         conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
spatial_dropout3d_4 (SpatialDro (None, 128, 16, 16,  0           leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 128, 16, 16,  442496      spatial_dropout3d_4[0][0]        
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 16, 16,  512         conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 16, 16,  0           leaky_re_lu_10[0][0]             
                                                                 leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 256, 8, 8, 8) 884992      add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 256, 8, 8, 8) 1024        conv3d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 256, 8, 8, 8) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 256, 8, 8, 8) 1769728     leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 256, 8, 8, 8) 1024        conv3d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 256, 8, 8, 8) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
spatial_dropout3d_5 (SpatialDro (None, 256, 8, 8, 8) 0           leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 256, 8, 8, 8) 1769728     spatial_dropout3d_5[0][0]        
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 256, 8, 8, 8) 1024        conv3d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 256, 8, 8, 8) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 256, 8, 8, 8) 0           leaky_re_lu_13[0][0]             
                                                                 leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 256, 16, 16,  0           add_5[0][0]                      
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 128, 16, 16,  884864      up_sampling3d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 16, 16,  512         conv3d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 16, 16,  0           add_4[0][0]                      
                                                                 leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 128, 16, 16,  884864      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 128, 16, 16,  512         conv3d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 128, 16, 16,  16512       leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 128, 16, 16,  512         conv3d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 128, 16, 16,  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 128, 32, 32,  0           leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 64, 32, 32, 3 221248      up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 64, 32, 32, 3 256         conv3d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 64, 32, 32, 3 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 32, 32,  0           add_3[0][0]                      
                                                                 leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 64, 32, 32, 3 221248      concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 64, 32, 32, 3 256         conv3d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 64, 32, 32, 3 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 64, 32, 32, 3 4160        leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 64, 32, 32, 3 256         conv3d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 64, 32, 32, 3 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 64, 64, 64, 6 0           leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 32, 64, 64, 6 55328       up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 32, 64, 64, 6 128         conv3d_23[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 32, 64, 64, 6 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 64, 6 0           add_2[0][0]                      
                                                                 leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 32, 64, 64, 6 55328       concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 32, 64, 64, 6 128         conv3d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 32, 64, 64, 6 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 32, 64, 64, 6 1056        leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 32, 64, 64, 6 128         conv3d_25[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 32, 64, 64, 6 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
up_sampling3d_4 (UpSampling3D)  (None, 32, 128, 128, 0           leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 16, 128, 128, 13840       up_sampling3d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 16, 128, 128, 64          conv3d_27[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 16, 128, 128, 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 128, 128, 0           add_1[0][0]                      
                                                                 leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 16, 128, 128, 13840       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 16, 128, 128, 64          conv3d_28[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 16, 128, 128, 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 1, 32, 32, 32 65          leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 16, 128, 128, 272         leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
up_sampling3d_5 (UpSampling3D)  (None, 1, 64, 64, 64 0           conv3d_22[0][0]                  
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 1, 64, 64, 64 33          leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 16, 128, 128, 64          conv3d_29[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 1, 64, 64, 64 0           up_sampling3d_5[0][0]            
                                                                 conv3d_26[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 16, 128, 128, 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
up_sampling3d_6 (UpSampling3D)  (None, 1, 128, 128,  0           add_6[0][0]                      
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 1, 128, 128,  17          leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 1, 128, 128,  0           up_sampling3d_6[0][0]            
                                                                 conv3d_30[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 128, 128,  0           add_7[0][0]                      

